[
   {
    "riddleText": "What has hands but can’t clap?",
    "answer": "A clock.",
    "translation": "У чего есть стрелки, но оно не может хлопать?"
  },
  {
    "riddleText": "What has to be broken before you can use it?",
    "answer": "An egg.",
    "translation": "Что нужно разбить, прежде чем использовать?"
  },
  {
    "riddleText": "I’m tall when I’m young, and I’m short when I’m old. What am I?",
    "answer": "A candle.",
    "translation": "Я высокий, когда молодой, и короткий, когда старый. Кто я?"
  },
  {
    "riddleText": "What goes up but never comes down?",
    "answer": "Your age.",
    "translation": "Что поднимается, но никогда не опускается?"
  },
  {
    "riddleText": "What has a head and a tail but no body?",
    "answer": "A coin.",
    "translation": "У чего есть голова и хвост, но нет тела?"
  },
  {
    "riddleText": "What gets wetter as it dries?",
    "answer": "A towel.",
    "translation": "Что становится мокрее, когда сушит?"
  },
  {
    "riddleText": "What can you catch but not throw?",
    "answer": "A cold.",
    "translation": "Что можно подхватить, но нельзя бросить?"
  },
  {
    "riddleText": "What kind of room has no doors or windows?",
    "answer": "A mushroom.",
    "translation": "Какая комната не имеет ни дверей, ни окон?"
  },
  {
    "riddleText": "What is full of holes but still holds water?",
    "answer": "A sponge.",
    "translation": "Что полно дыр, но всё равно держит воду?"
  },
  {
    "riddleText": "What has one eye but can’t see?",
    "answer": "A needle.",
    "translation": "У чего есть один глаз, но оно не видит?"
  },
  {
    "riddleText": "What begins with T, ends with T, and has T in it?",
    "answer": "A teapot.",
    "translation": "Что начинается на T, заканчивается на T и содержит T внутри?"
  },
  {
    "riddleText": "The more you take, the more you leave behind. What are they?",
    "answer": "Footsteps.",
    "translation": "Чем больше ты берешь, тем больше оставляешь позади. Что это?"
  },
  {
    "riddleText": "What has many keys but can’t open a single lock?",
    "answer": "A piano.",
    "translation": "У чего много клавиш, но ни один замок не открыть?"
  },
  {
    "riddleText": "Where does today come before yesterday?",
    "answer": "In the dictionary.",
    "translation": "Где сегодня идет перед вчерашним?"
  },
  {
    "riddleText": "What has words but never speaks?",
    "answer": "A book.",
    "translation": "У чего есть слова, но оно никогда не говорит?"
  },
  {
    "riddleText": "What kind of band never plays music?",
    "answer": "A rubber band.",
    "translation": "Какой «бэнд» никогда не играет музыку?"
  },
  {
    "riddleText": "What comes down but never goes up?",
    "answer": "Rain.",
    "translation": "Что падает вниз, но никогда не поднимается вверх?"
  },
  {
    "riddleText": "I have a face and two hands, but no arms or legs. What am I?",
    "answer": "A clock.",
    "translation": "У меня есть лицо и две стрелки, но нет рук и ног. Кто я?"
  },
  {
    "riddleText": "What can travel around the world while staying in the same spot?",
    "answer": "A stamp.",
    "translation": "Что может облететь весь мир, оставаясь на месте?"
  },
  {
    "riddleText": "What runs but never walks, has a bed but never sleeps?",
    "answer": "A river.",
    "translation": "Что бежит, но не ходит, имеет постель, но не спит?"
  },
  {
    "riddleText": "What has four legs in the morning, two legs at noon, and three legs in the evening?",
    "answer": "A human.",
    "translation": "Кто утром на четырех ногах, днем на двух, а вечером на трех?"
  },
  {
    "riddleText": "What belongs to you but is used more by others?",
    "answer": "Your name.",
    "translation": "Что принадлежит тебе, но чаще используется другими?"
  },
  {
    "riddleText": "What can you keep after giving to someone?",
    "answer": "Your word.",
    "translation": "Что ты можешь сохранить, даже отдав кому-то?"
  },
  {
    "riddleText": "What has a neck but no head?",
    "answer": "A bottle.",
    "translation": "У чего есть шея, но нет головы?"
  },
  {
    "riddleText": "What has an eye but cannot see?",
    "answer": "A hurricane.",
    "translation": "У чего есть глаз, но оно не видит?"
  },
  {
    "riddleText": "What comes once in a minute, twice in a moment, but never in a thousand years?",
    "answer": "The letter \"M\".",
    "translation": "Что встречается один раз в минуте, дважды в моменте, но ни разу за тысячу лет?"
  },
  {
    "riddleText": "What can fill a room but takes up no space?",
    "answer": "Light.",
    "translation": "Что может заполнить комнату, но не занимает места?"
  },
  {
    "riddleText": "What kind of tree can you carry in your hand?",
    "answer": "A palm.",
    "translation": "Какое дерево ты можешь унести в руке?"
  },
  {
    "riddleText": "What has legs but doesn’t walk?",
    "answer": "A table.",
    "translation": "У чего есть ноги, но оно не ходит?"
  },
  {
    "riddleText": "What has a thumb and four fingers but is not alive?",
    "answer": "A glove.",
    "translation": "У чего есть большой палец и четыре пальца, но оно не живое?"
  },
  {
    "riddleText": "What invention lets you look right through a wall?",
    "answer": "A window.",
    "translation": "Какое изобретение позволяет заглянуть сквозь стену?"
  },
  {
    "riddleText": "What has ears but cannot hear?",
    "answer": "Corn.",
    "translation": "У чего есть уши, но оно не слышит?"
  },
  {
    "riddleText": "I go up and down the stairs without moving. What am I?",
    "answer": "A carpet.",
    "translation": "Я поднимаюсь и спускаюсь по лестнице, не двигаясь. Кто я?"
  },
  {
    "riddleText": "What flies without wings?",
    "answer": "Time.",
    "translation": "Что летает без крыльев?"
  },
  {
    "riddleText": "What has no beginning, no end, and no middle?",
    "answer": "A circle.",
    "translation": "У чего нет начала, конца и середины?"
  },
  {
    "riddleText": "What is always in front of you but can’t be seen?",
    "answer": "The future.",
    "translation": "Что всегда перед тобой, но ты не можешь это увидеть?"
  },
  {
    "riddleText": "What has teeth but doesn’t bite?",
    "answer": "A comb.",
    "translation": "У чего есть зубы, но оно не кусается?"
  },
  {
    "riddleText": "What can be cracked, made, told, and played?",
    "answer": "A joke.",
    "translation": "Что можно треснуть, создать, рассказать и сыграть?"
  },
  {
    "riddleText": "What kind of coat is always wet when you put it on?",
    "answer": "A coat of paint.",
    "translation": "Какое пальто всегда мокрое, когда ты его надеваешь?"
  },
  {
    "riddleText": "What is easy to lift but hard to throw?",
    "answer": "A feather.",
    "translation": "Что легко поднять, но трудно бросить?"
  },
  {
    "riddleText": "What can’t talk but will reply when spoken to?",
    "answer": "An echo.",
    "translation": "Что не умеет говорить, но отвечает, когда с ним говорят?"
  },
  {
    "riddleText": "What kind of cup can’t hold water?",
    "answer": "A cupcake.",
    "translation": "Какая чашка не может удержать воду?"
  },
  {
    "riddleText": "What comes after thunder?",
    "answer": "The letter \"R\".",
    "translation": "Что идет после грома? (Подсказка: в слове)"
  },
  {
    "riddleText": "What is black when it’s clean and white when it’s dirty?",
    "answer": "A chalkboard.",
    "translation": "Что черное, когда чистое, и белое, когда грязное?"
  },
  {
    "riddleText": "What type of cheese is made backward?",
    "answer": "Edam.",
    "translation": "Какой сыр делается наоборот? (Подсказка: «Edam» — это «made» наоборот)"
  },
  {
    "riddleText": "What goes around the world but stays in one spot?",
    "answer": "A stamp.",
    "translation": "Что объезжает весь мир, оставаясь на одном месте?"
  },
  {
    "riddleText": "What begins and ends with an E but only has one letter?",
    "answer": "An envelope.",
    "translation": "Что начинается и заканчивается на E, но содержит всего одну букву?"
  },
  {
    "riddleText": "What never asks questions but gets answered all the time?",
    "answer": "A phone.",
    "translation": "Что никогда не задаёт вопросов, но получает ответы постоянно?"
  },
  {
    "riddleText": "What has cities but no houses, forests but no trees, and rivers but no water?",
    "answer": "A map.",
    "translation": "У чего есть города, но нет домов, леса без деревьев и реки без воды?"
  },
  {
    "riddleText": "What has stripes but no color?",
    "answer": "A zebra in a black-and-white photo.",
    "translation": "У кого есть полоски, но нет цвета? (Зебра на чёрно-белом фото)"
  },
  {
    "riddleText": "What can you hear but not see or touch?",
    "answer": "A voice.",
    "translation": "Что ты можешь слышать, но не можешь ни увидеть, ни потрогать?"
  },
  {
    "riddleText": "What kind of key can’t open doors?",
    "answer": "A monkey.",
    "translation": "Какой ключ не открывает двери?"
  },
  {
    "riddleText": "What has roots but never grows, has a trunk but no leaves?",
    "answer": "An elephant.",
    "translation": "У кого есть корни, но он не растёт, есть хобот, но нет листьев?"
  },
  {
    "riddleText": "What flies without wings and cries without eyes?",
    "answer": "A cloud.",
    "translation": "Что летает без крыльев и плачет без глаз?"
  },
  {
    "riddleText": "What gets sharper the more you use it?",
    "answer": "Your brain.",
    "translation": "Что становится острее, чем больше ты это используешь?"
  },
  {
    "riddleText": "What has no bones but can be broken?",
    "answer": "A promise.",
    "translation": "У чего нет костей, но оно может быть нарушено?"
  },
  {
    "riddleText": "What has one head, one foot, and four legs?",
    "answer": "A bed.",
    "translation": "У чего одна голова, одна нога и четыре ноги?"
  },
  {
    "riddleText": "What can run but never walks, has a mouth but never talks?",
    "answer": "A river.",
    "translation": "Что может бежать, но не ходит, имеет устье, но не говорит?"
  },
  {
    "riddleText": "What is white and cold and falls from the sky in winter?",
    "answer": "Snow.",
    "translation": "Что белое и холодное, падает с неба зимой?"
  },
  {
    "riddleText": "What has a ring but no finger?",
    "answer": "A telephone.",
    "translation": "У чего есть звонок, но нет пальцев?"
  },
  {
    "riddleText": "What has wheels and flies, but it’s not an aircraft?",
    "answer": "A garbage truck.",
    "translation": "У чего есть колёса и мухи, но это не самолёт? (Подсказка: «flies» — также «мухи»)"
  },
  {
    "riddleText": "What has five fingers but is not alive?",
    "answer": "A glove.",
    "translation": "У чего пять пальцев, но оно не живое?"
  },
  {
    "riddleText": "What gets bigger the more you take away from it?",
    "answer": "A hole.",
    "translation": "Что становится больше, когда ты убираешь из него что-то?"
  },
  {
    "riddleText": "What’s full of gas but can’t be driven?",
    "answer": "A balloon.",
    "translation": "Что наполнено газом, но на нём нельзя ездить?"
  },
  {
    "riddleText": "What do you find at the end of a rainbow?",
    "answer": "The letter \"W\".",
    "translation": "Что находится в конце радуги? (Подсказка: в слове «rainbow»)"
  },
  {
    "riddleText": "What has a spine but no bones?",
    "answer": "A book.",
    "translation": "У чего есть позвоночник, но нет костей?"
  },
  {
    "riddleText": "What doesn’t get wetter, no matter how much it rains?",
    "answer": "The sea.",
    "translation": "Что не становится более мокрым, как бы сильно ни шёл дождь?"
  },
  {
    "riddleText": "What has numbers but can’t count?",
    "answer": "A calculator with dead batteries.",
    "translation": "У чего есть цифры, но оно не может считать? (Подсказка: сели батарейки)"
  },
  {
    "riddleText": "What can you see once in a year, twice in a week, but never in a day?",
    "answer": "The letter \"E\".",
    "translation": "Что можно увидеть один раз в году, дважды в неделе и ни разу в дне?"
  },
  {
    "riddleText": "What goes through cities and fields but never moves?",
    "answer": "A road.",
    "translation": "Что проходит через города и поля, но само не движется?"
  },
  {
    "riddleText": "What kind of dog never barks?",
    "answer": "A hot dog.",
    "translation": "Какая собака никогда не лает?"
  },
  {
    "riddleText": "What kind of table has no legs?",
    "answer": "A timetable.",
    "translation": "Какой стол не имеет ножек?"
  },
  {
    "riddleText": "What can go up a chimney down but not down a chimney up?",
    "answer": "An umbrella.",
    "translation": "Что может пройти вверх по дымоходу в сложенном виде, но не вниз в раскрытом?"
  },
  {
    "riddleText": "What’s as light as a feather but even the world’s strongest man couldn’t hold it for long?",
    "answer": "His breath.",
    "translation": "Что легче пера, но даже самый сильный человек не может удержать это долго?"
  },
  {
    "riddleText": "What runs around your backyard but never moves?",
    "answer": "A fence.",
    "translation": "Что окружает твой двор, но само не двигается?"
  },
  {
    "riddleText": "What is made of water but can’t be wet?",
    "answer": "An ice sculpture.",
    "translation": "Из чего сделано из воды, но не может быть мокрым?"
  },
  {
    "riddleText": "What goes up when the rain comes down?",
    "answer": "An umbrella.",
    "translation": "Что поднимается вверх, когда начинается дождь?"
  },
  {
    "riddleText": "What has a tail but no body?",
    "answer": "A kite.",
    "translation": "У чего есть хвост, но нет тела?"
  },
  {
    "riddleText": "What do you break every time you say its name?",
    "answer": "Silence.",
    "translation": "Что ты нарушаешь каждый раз, когда произносишь его название?"
  },
  {
    "riddleText": "What is always running but never moves?",
    "answer": "A refrigerator.",
    "translation": "Что всегда работает (бежит), но не двигается?"
  },
  {
    "riddleText": "What has no life but can die?",
    "answer": "A battery.",
    "translation": "У чего нет жизни, но оно может «умереть»?"
  },
  {
    "riddleText": "What kind of lion never roars?",
    "answer": "A dandelion.",
    "translation": "Какой лев никогда не рычит?"
  },
  {
    "riddleText": "What has teeth but can’t eat?",
    "answer": "A zipper.",
    "translation": "У чего есть зубы, но оно не может есть?"
  },
  {
    "riddleText": "What has a lock but no door?",
    "answer": "Hair.",
    "translation": "У чего есть замок (локон), но нет двери?"
  },
  {
    "riddleText": "What is the end of everything?",
    "answer": "The letter \"G\".",
    "translation": "Что находится в конце всего? (Подсказка: в слове 'everything')"
  },
  {
    "riddleText": "What has no voice, but can still be heard?",
    "answer": "An echo.",
    "translation": "У чего нет голоса, но его всё равно можно услышать?"
  },
  {
    "riddleText": "What can’t be burned in a fire nor drowned in water?",
    "answer": "Ice.",
    "translation": "Что нельзя сжечь в огне и утопить в воде?"
  },
  {
    "riddleText": "What can you hold in your left hand but not in your right?",
    "answer": "Your right hand.",
    "translation": "Что ты можешь держать в левой руке, но не в правой?"
  },
  {
    "riddleText": "What is always late but never arrives?",
    "answer": "Tomorrow.",
    "translation": "Что всегда опаздывает, но никогда не наступает?"
  }
]
