import React, { useState } from 'react';
import Input from '../../components/Input/Input';
import styles from './Account.module.scss';

const Account = () => {
  const [showCurrentPassword, setShowCurrentPassword] = useState(false);
  const [showNewPassword, setShowNewPassword] = useState(false);
  const [showConfirmPassword, setShowConfirmPassword] = useState(false);
  const [formData, setFormData] = useState({
    name: '',
    email: '',
    currentPassword: '',
    newPassword: '',
    confirmPassword: '',
    phone: '',
  });

  const userData = {
    name: 'Alexandra Zavoykina',
    email: 'alexbidlo@gmail.com',
    avatar: '/avatar.jpg',
    alt: 'AZ',
  };

  const handleChange = (e) => {
    const { id, value } = e.target;
    setFormData((prev) => ({
      ...prev,
      [id]: value,
    }));
  };

  const icons = {
    name: (
      <svg
        width='31'
        height='31'
        viewBox='0 0 31 31'
        fill='none'
        xmlns='http://www.w3.org/2000/svg'
      >
        <path
          d='M12.9883 4.43553H17.4236C17.9485 4.43553 18.3741 4.86106 18.3741 5.38596V7.60363H12.0379V5.38596C12.0379 4.86106 12.4634 4.43553 12.9883 4.43553ZM10.137 5.38596V7.60363H7.91932C5.64471 7.60363 3.80078 9.44756 3.80078 11.7222V13.623C3.80078 14.8478 4.79366 15.8407 6.01845 15.8407H12.6715V15.2071C12.6715 14.5072 13.2388 13.9398 13.9387 13.9398H16.4732C17.1731 13.9398 17.7404 14.5072 17.7404 15.2071V15.8407H24.3935C25.6182 15.8407 26.6111 14.8478 26.6111 13.623V11.7222C26.6111 9.44756 24.7672 7.60363 22.4926 7.60363H20.2749V5.38596C20.2749 3.81124 18.9983 2.53467 17.4236 2.53467H12.9883C11.4136 2.53467 10.137 3.81124 10.137 5.38596ZM26.6111 17.0941C25.971 17.504 25.2099 17.7416 24.3935 17.7416H17.7404C17.7404 18.4415 17.1731 19.0088 16.4732 19.0088H13.9387C13.2388 19.0088 12.6715 18.4415 12.6715 17.7416H6.01845C5.20194 17.7416 4.44093 17.504 3.80078 17.0941V21.2265C3.80078 23.501 5.64471 25.345 7.91932 25.345H22.4926C24.7672 25.345 26.6111 23.501 26.6111 21.2265V17.0941Z'
          fill='#ABB1BB'
        />
      </svg>
    ),
    email: (
      <svg
        width='28'
        height='28'
        viewBox='0 0 28 28'
        fill='none'
        xmlns='http://www.w3.org/2000/svg'
      >
        <path
          d='M25.6673 10.0425V19.5415C25.6673 21.5633 24.0847 23.2156 22.0908 23.3272L21.8757 23.3332H6.12565C4.10378 23.3332 2.45153 21.7506 2.33998 19.7566L2.33398 19.5415V10.0425L13.5947 15.9416C13.849 16.0748 14.1523 16.0748 14.4067 15.9416L25.6673 10.0425ZM6.12565 4.6665H21.8757C23.8411 4.6665 25.4574 6.16207 25.6484 8.07731L14.0007 14.1787L2.35287 8.07731C2.53682 6.233 4.04236 4.77786 5.90876 4.67261L6.12565 4.6665Z'
          fill='#ABB1BB'
        />
      </svg>
    ),
    phone: (
      <svg
        width='28'
        height='28'
        viewBox='0 0 28 28'
        fill='none'
        xmlns='http://www.w3.org/2000/svg'
      >
        <path
          d='M18.375 2.3335C19.8247 2.3335 21 3.50875 21 4.9585V23.0418C21 24.4915 19.8247 25.6668 18.375 25.6668H9.625C8.17525 25.6668 7 24.4915 7 23.0418V4.9585C7 3.50875 8.17525 2.3335 9.625 2.3335H18.375ZM15.4583 21.0002H12.5417C12.0584 21.0002 11.6667 21.3919 11.6667 21.8752C11.6667 22.3584 12.0584 22.7502 12.5417 22.7502H15.4583C15.9416 22.7502 16.3333 22.3584 16.3333 21.8752C16.3333 21.3919 15.9416 21.0002 15.4583 21.0002Z'
          fill='#ABB1BB'
        />
      </svg>
    ),
    password: (
      <svg
        width='34'
        height='34'
        viewBox='0 0 34 34'
        fill='none'
        xmlns='http://www.w3.org/2000/svg'
      >
        <g clip-path='url(#clip0_18_792)'>
          <path
            d='M17.2787 12.4114C19.8693 9.89133 24.0208 9.94863 26.5409 12.5393C29.0491 15.1177 29.0875 19.1999 26.4847 21.7318C23.894 24.2519 19.7426 24.1946 17.2225 21.6039C16.8527 21.2238 16.542 20.7953 16.2872 20.3502C15.7907 20.7993 15.0239 20.7779 14.5533 20.2941L13.3331 19.0397L12.0787 20.26C11.5838 20.7414 10.7925 20.7305 10.3111 20.2356L9.09084 18.9812L8.19484 19.8528C7.50205 20.5267 6.39412 20.5114 5.7202 19.8186L3.977 18.0266C3.30308 17.3338 3.31838 16.2259 4.01117 15.552L5.56777 14.0378C6.09053 13.5293 6.79396 13.2492 7.52321 13.2593L16.3411 13.381C16.4181 13.3821 16.504 13.3439 16.5643 13.2604C16.7686 12.9776 17.0011 12.6814 17.2787 12.4114ZM24.9103 17.9621C25.4051 17.4807 25.416 16.6893 24.9347 16.1945C24.4533 15.6996 23.6619 15.6887 23.1671 16.1701C22.6723 16.6515 22.6613 17.4428 23.1427 17.9377C23.624 18.4325 24.4154 18.4435 24.9103 17.9621Z'
            fill='#ABB1BB'
          />
        </g>
        <defs>
          <clipPath id='clip0_18_792'>
            <rect
              width='24'
              height='24'
              fill='white'
              transform='translate(17.2031) rotate(45.7909)'
            />
          </clipPath>
        </defs>
      </svg>
    ),
  };

  const addPhotoIcon = (
    <svg
      width='23'
      height='23'
      viewBox='0 0 23 23'
      fill='none'
      xmlns='http://www.w3.org/2000/svg'
    >
      <path
        fill-rule='evenodd'
        clip-rule='evenodd'
        d='M6.757 5.40005C7.2055 5.10038 7.73279 4.94043 8.2722 4.94043C8.61851 4.94043 8.89925 5.22117 8.89925 5.56747C8.89925 5.91378 8.61851 6.19451 8.2722 6.19451C7.98083 6.19451 7.69601 6.28091 7.45375 6.44278C7.21149 6.60465 7.02267 6.83472 6.91117 7.1039C6.79967 7.37308 6.7705 7.66928 6.82734 7.95504C6.88418 8.24079 7.02449 8.50328 7.23051 8.7093C7.43654 8.91532 7.69903 9.05563 7.9848 9.11247C8.27056 9.16931 8.56676 9.14013 8.83595 9.02864C9.10513 8.91714 9.33521 8.72832 9.49708 8.48607C9.65896 8.24381 9.74536 7.959 9.74536 7.66764C9.74536 7.32134 10.0261 7.0406 10.3724 7.0406C10.7187 7.0406 10.9995 7.32134 10.9995 7.66764C10.9995 8.20703 10.8395 8.73431 10.5398 9.1828C10.2402 9.63129 9.81422 9.98084 9.31588 10.1873C8.81753 10.3937 8.26917 10.4477 7.74013 10.3425C7.21109 10.2372 6.72514 9.97748 6.34372 9.59607C5.96231 9.21467 5.70256 8.72872 5.59733 8.1997C5.49209 7.67067 5.5461 7.12232 5.75252 6.62398C5.95895 6.12565 6.30851 5.69972 6.757 5.40005Z'
        fill='#1E3758'
      />
      <path
        fill-rule='evenodd'
        clip-rule='evenodd'
        d='M21.8974 8.57568C22.2387 8.57568 22.5154 8.85814 22.5154 9.20656V14.4891C22.5154 17.1915 21.9927 19.2473 20.6633 20.612C19.3329 21.9776 17.328 22.5148 14.6936 22.5148H8.51908C5.88553 22.5148 3.88065 21.9778 2.55013 20.6124C1.22043 19.2478 0.697266 17.192 0.697266 14.4891V12.3652C0.697266 12.0167 0.973968 11.7343 1.3153 11.7343C1.65663 11.7343 1.93333 12.0167 1.93333 12.3652V14.4891C1.93333 17.0688 2.44022 18.7104 3.42649 19.7226C4.41195 20.7339 6.00896 21.253 8.51908 21.253H14.6936C17.2046 21.253 18.8015 20.7337 19.7868 19.7223C20.7729 18.7101 21.2794 17.0685 21.2794 14.4891V9.20656C21.2794 8.85814 21.5561 8.57568 21.8974 8.57568Z'
        fill='#1E3758'
      />
      <path
        fill-rule='evenodd'
        clip-rule='evenodd'
        d='M2.57585 2.56054C3.92407 1.22297 5.95563 0.696777 8.62615 0.696777H12.8013C13.1455 0.696777 13.4245 0.973625 13.4245 1.31513C13.4245 1.65664 13.1455 1.93349 12.8013 1.93349H8.62615C6.07862 1.93349 4.45738 2.44284 3.4573 3.43503C2.45722 4.42721 1.94382 6.03566 1.94382 8.56309C1.94382 8.90459 1.66477 9.18144 1.32054 9.18144C0.976315 9.18144 0.697266 8.90459 0.697266 8.56309C0.697266 5.91364 1.22764 3.89811 2.57585 2.56054Z'
        fill='#1E3758'
      />
      <path
        fill-rule='evenodd'
        clip-rule='evenodd'
        d='M14.6387 4.3331C14.6387 3.99839 14.9291 3.72705 15.2874 3.72705H21.2627C21.621 3.72705 21.9114 3.99839 21.9114 4.3331C21.9114 4.66781 21.621 4.93915 21.2627 4.93915H15.2874C14.9291 4.93915 14.6387 4.66781 14.6387 4.3331Z'
        fill='#1E3758'
      />
      <path
        fill-rule='evenodd'
        clip-rule='evenodd'
        d='M18.2721 0.696777C18.6068 0.696777 18.8781 0.987219 18.8781 1.3455V7.32063C18.8781 7.67891 18.6068 7.96935 18.2721 7.96935C17.9374 7.96935 17.666 7.67891 17.666 7.32063V1.3455C17.666 0.987219 17.9374 0.696777 18.2721 0.696777Z'
        fill='#1E3758'
      />
      <path
        fill-rule='evenodd'
        clip-rule='evenodd'
        d='M17.6964 12.6211L13.4072 16.3341L13.3958 16.3437C12.8743 16.7736 12.22 17.0087 11.5447 17.0087C10.8695 17.0087 10.2152 16.7736 9.6937 16.3437C9.68808 16.3391 9.68254 16.3343 9.67708 16.3295L9.34597 16.0363C9.0687 15.8126 8.72814 15.6819 8.37248 15.6629C8.01462 15.6438 7.65995 15.7387 7.35932 15.9341L2.27074 19.3781C1.9867 19.5703 1.60094 19.4954 1.40911 19.2108C1.21727 18.9261 1.29202 18.5396 1.57605 18.3473L6.67737 14.8947C7.19939 14.5535 7.81622 14.3876 8.43858 14.4209C9.06094 14.4541 9.65661 14.6849 10.1395 15.0798C10.1457 15.0849 10.1519 15.0902 10.158 15.0955L10.4901 15.3896C10.7881 15.6323 11.1605 15.7649 11.5447 15.7649C11.93 15.7649 12.3034 15.6315 12.6019 15.3875L16.8912 11.6746L16.9026 11.665C17.424 11.2351 18.0783 11 18.7536 11C19.4289 11 20.0832 11.2351 20.6046 11.665L20.6161 11.6746L22.2999 13.1324C22.5593 13.3569 22.5879 13.7496 22.3639 14.0096C22.1398 14.2695 21.7479 14.2982 21.4885 14.0736L19.8107 12.6211C19.5123 12.3771 19.1389 12.2438 18.7536 12.2438C18.3683 12.2438 17.9949 12.3771 17.6964 12.6211Z'
        fill='#1E3758'
      />
    </svg>
  );

  const handleSubmit = (e) => {
    e.preventDefault();
    console.log('Form data submitted:', formData);
    // Тут логика отправки данных на сервер
  };

  return (
    <div className={styles.accountSettingsContainer}>
      <div className={styles.headerBg}></div>

      {/* Профиль пользователя */}
      <div className={styles.profile}>
        <div className={styles.avatarWrapper}>
          <img
            // src={userData.avatar}
            src='https://via.placeholder.com/90'
            alt={userData.alt}
            className={styles.avatar}
          />
          <span className={styles.addPhoto}>{addPhotoIcon}</span>
        </div>
        <div className={styles.userInfo}>
          <h2 className={styles.userName}>
            {userData.name}{' '}
            <svg
              width='18'
              height='20'
              viewBox='0 0 18 20'
              fill='none'
              xmlns='http://www.w3.org/2000/svg'
            >
              <path
                d='M8.21878 18.1057H3.42312C2.11982 18.1057 1.06235 16.997 1.06235 15.6397V3.56652C1.06235 2.20513 2.12372 1.10053 3.42312 1.10053H8.29682C8.58948 1.10053 8.8236 0.855965 8.8236 0.550263C8.8236 0.244561 8.58948 0 8.29682 0H3.42312C1.53841 0 0.00878906 1.60188 0.00878906 3.56652V15.6397C0.00878906 17.6084 1.54231 19.2062 3.42312 19.2062H8.21878C8.51144 19.2062 8.74556 18.9617 8.74556 18.656C8.74556 18.3503 8.50754 18.1057 8.21878 18.1057Z'
                fill='#384D6C'
              />
              <path
                d='M16.8974 9.21589L13.5494 5.71866C13.3426 5.50263 13.0109 5.50263 12.8041 5.71866C12.5973 5.93469 12.5973 6.28115 12.8041 6.49718L15.2546 9.05692H4.56682C4.27416 9.05692 4.04004 9.30149 4.04004 9.60719C4.04004 9.91289 4.27416 10.1574 4.56682 10.1574H15.2546L12.8041 12.7172C12.5973 12.9332 12.5973 13.2797 12.8041 13.4957C12.9056 13.6017 13.0422 13.6588 13.1748 13.6588C13.3075 13.6588 13.4441 13.6058 13.5455 13.4957L16.8935 9.99849C17.1042 9.77838 17.1042 9.42784 16.8974 9.21589Z'
                fill='#384D6C'
              />
            </svg>
          </h2>
          <p className={styles.userEmail}>{userData.email}</p>
          <button className={styles.verifyButton}>
            <span className={styles.verifyIcon}>
              <svg
                width='11'
                height='10'
                viewBox='0 0 11 10'
                fill='none'
                xmlns='http://www.w3.org/2000/svg'
              >
                <path
                  d='M9.51172 1.12012L5.44922 5.18262M5.44922 5.18262L1.38672 9.24512M5.44922 5.18262L1.38672 1.12012M5.44922 5.18262L9.51172 9.24512'
                  stroke='white'
                  stroke-width='1.25551'
                  stroke-linecap='round'
                  stroke-linejoin='round'
                />
              </svg>
            </span>
            <span>Удалить аккаунт</span>
          </button>
        </div>
      </div>

      <form onSubmit={handleSubmit} className={styles.formContainer}>
        <div className={styles.formGrid}>
          <Input
            id='name'
            label='Имя'
            placeholder='Введите новый никнейм'
            value={formData.name}
            onChange={handleChange}
            icon={icons.name}
          />

          <Input
            id='currentPassword'
            label='Текущий пароль'
            placeholder='Введите текущий пароль'
            value={formData.currentPassword}
            onChange={handleChange}
            isPassword={true}
            showPassword={showCurrentPassword}
            toggleShowPassword={() =>
              setShowCurrentPassword(!showCurrentPassword)
            }
            icon={icons.password}
          />
          <Input
            id='email'
            label='Почта'
            type='email'
            placeholder='Введите новый почтовый адрес'
            value={formData.email}
            onChange={handleChange}
            icon={icons.email}
          />
          <Input
            id='newPassword'
            label='Новый пароль'
            placeholder='Введите новый пароль'
            value={formData.newPassword}
            onChange={handleChange}
            isPassword={true}
            showPassword={showNewPassword}
            toggleShowPassword={() => setShowNewPassword(!showNewPassword)}
            icon={icons.password}
          />
          <Input
            id='phone'
            label='Телефон'
            type='tel'
            placeholder='Введите новый номер телефона'
            value={formData.phone}
            onChange={handleChange}
            icon={icons.phone}
          />

          <Input
            id='confirmPassword'
            label='Подтверждение пароля'
            placeholder='Подтвердите новый пароль'
            value={formData.confirmPassword}
            onChange={handleChange}
            isPassword={true}
            showPassword={showConfirmPassword}
            toggleShowPassword={() =>
              setShowConfirmPassword(!showConfirmPassword)
            }
            icon={icons.password}
          />
        </div>

        <button type='submit' className={styles.saveButton}>
          Сохранить изменения
        </button>
      </form>
    </div>
  );
};

export default Account;
